routes/channels.php

*/

Broadcast::channel('notifications.{id}', function ($user, $id) {
	return $user->id==User::find($id)->id;
---
SELECT * FROM `users` WHERE `users`.`id` = '1' LIMIT 1