app/Http/Controllers/AuthController.php

SELECT * FROM `emails` WHERE `address` = 'nugiko777' LIMIT 1
SELECT * FROM `emails` WHERE `address` = 'nugiko123' LIMIT 1
---
	public function login(LoginRequest $request)
	{
		$secondaryEmailToken = null;
		$checkPassword = null;
		$username = $request->name;
		$password = $request->password;
		$usernameType = filter_var($username, FILTER_VALIDATE_EMAIL) ? 'email' : 'name';
		$token = auth()->attempt([$usernameType=>$username, 'password'=>$password]);
		if (!$token)
		{
			$secondaryEmailToken = Email::where('address', $username)->first();
		}
		if (Email::where('address', $username)->first())

SELECT * FROM `users` WHERE `name` = 'nugiko123' LIMIT 1
---
		{
			$payload = [
				'exp' => Carbon::now()->addMinutes(30)->timestamp,
				'uid' => User::where($usernameType, $username)->first()->id,