app/Http/Controllers/CommentController.php

	public function create(AddCommentRequest $request): JsonResponse
	{
		Comment::create([
			'body'     => $request->body,
			'quote_id' => $request->quote_id,
			'user_id'  => $request->user_id,
		]);
---
INSERT INTO `comments` (`body`, `quote_id`, `user_id`, `updated_at`, `created_at`) VALUES ('wow', 9, 1, '2022-12-13 12:12:29', '2022-12-13 12:12:29')