app/Http/Controllers/GenreController.php

    public function index(): JsonResponse
	{
		return response()->json(Genre::all(), 200);
---
SELECT * FROM `genres`