app/Http/Controllers/LikeController.php

   public function create(AddLikeRequest $request, Like $like, Notification $notification): JsonResponse
   {
		 $alreadyLiked = $like->where('quote_id', $request->quote_id)->where('user_id', $request->user_id)->first();
		 $notificationExists = $notification->where('quote_id', $request->quote_id)->where('user_id', $request->user_id)->where('body', null)->first();
   	if ($alreadyLiked)
   	{
			 $alreadyLiked->delete();
			 $notificationExists->delete();
---
DELETE FROM `notifications` WHERE `id` = 11