app/Http/Controllers/LikeController.php

	public function getUserLikes($userId): JsonResponse
	{
		$quotesData=Quote::where('user_id', $userId)->pluck('id');
		$likesData=Like::whereIn('quote_id', $quotesData)->with('user:id,name,thumbnail')->get();
---
SELECT * FROM `likes` WHERE `quote_id` = 2

   public function create(AddLikeRequest $request, Like $like): JsonResponse
   {
		 $alreadyLiked = $like->where('quote_id', $request->quote_id)->where('user_id', $request->user_id)->first();
   	if ($alreadyLiked)
   	{
			 $alreadyLiked->delete();
---
DELETE FROM `likes` WHERE `id` = 8