app/Http/Controllers/MovieController.php

SELECT * FROM `movies` WHERE `user_id` = 1
SELECT * FROM `quotes` WHERE `quotes`.`movie_id` in (1, 2)
---
	public function index(): JsonResponse
	{
		return response()->json(Movie::where('user_id', jwtUser()->id)->with('quotes')->get());

SELECT * FROM `comments` WHERE `comments`.`quote_id` in (1)
SELECT * FROM `likes` WHERE `likes`.`quote_id` in (1)
SELECT * FROM `quotes` WHERE `movie_id` = 1
SELECT `id`, `name`, `thumbnail` FROM `users` WHERE `users`.`id` in (1)
SELECT * FROM `movies` WHERE `id` = 1 LIMIT 1
SELECT `genres`.*, `genre_movie`.`movie_id` as `pivot_movie_id`, `genre_movie`.`genre_id` as `pivot_genre_id` FROM `genres` inner join `genre_movie` on `genres`.`id` = `genre_movie`.`genre_id` WHERE `genre_movie`.`movie_id` = 1
---
	public function show(Movie $movie): JsonResponse
	{
		$quotes = Quote::where('movie_id', $movie->id)->with('likes', 'comments', 'user:id,name,thumbnail')->get();
		return response()->json(['movie'=>$movie->load('user:id,name,thumbnail'), 'genres'=>$movie->genres, 'quotes'=>$quotes]);

DELETE FROM `genre_movie` WHERE `movie_id` = 1
---
	private function updateOrCreateMovie($request, $movie)
	{

	  if($request->file('thumbnail'))	$movie->thumbnail = $request->file('thumbnail')->store('images');
		if ($request->user_id ? $movie->user_id = $request->user_id : null);
		$movie->setTranslation('name', 'en', $request->name_en);
		$movie->setTranslation('name', 'ka', $request->name_ka);
		$movie->setTranslation('director', 'en', $request->director_en);
		$movie->setTranslation('director', 'ka', $request->director_ka);
		$movie->setTranslation('description', 'en', $request->description_en);
		$movie->setTranslation('description', 'ka', $request->description_ka);
		$movie->save();
		$movie->id ? $movie_id = $movie->id : $movie_id = Movie::orderBy('id', 'desc')->first()->id;
		$genre = explode(',', $request->genre);
		DB::table('genre_movie')->where('movie_id', $movie_id)->delete();