app/Http/Controllers/NewsFeedController.php

SELECT * FROM `comments` WHERE `comments`.`quote_id` in (1)
SELECT * FROM `likes` WHERE `likes`.`quote_id` in (1)
SELECT * FROM `quotes` ORDER BY `id` DESC LIMIT 5 offset 0
SELECT `id`, `name` FROM `movies` WHERE `movies`.`id` in (1)
---
    public function index(): JsonResponse
	{
		$quotes = Quote::orderBy('id', 'DESC')->with('comments', 'comments.user:id,name,thumbnail', 'likes', 'user:id,name,thumbnail', 'movie:id,name')->paginate(5);