app/Http/Controllers/NotificationController.php

	public function index(User $user)
	{
		$quotes = $user->quotes->pluck('id');
		$notifications = Notification::whereIn('quote_id', $quotes)->where('user_id', '!=', $user)->with('user:id,name,thumbnail')->latest()->get();
---
SELECT `id`, `name`, `thumbnail` FROM `users` WHERE `users`.`id` in (1, 2)