app/Http/Controllers/OAuthController.php

	public function callback(): RedirectResponse
	{
		$googleUser = Socialite::driver('google')->stateless()->user();
		$user = User::updateOrCreate(
			[
				'google_id' => $googleUser->id,
			],
			[
				'name'                 => $googleUser->name,
				'email'                => $googleUser->email,
				'google_token'         => $googleUser->token,
				'password'             => bcrypt($googleUser->id),
				'is_verified'          => 1,
				'google_refresh_token' => $googleUser->refreshToken,
			]
		);

		$token = auth()->attempt(['email' => $googleUser->email, 'password'=>$googleUser->id]);
		if (!$token)
		{
			return response()->json(['error' => 'User Does not exist!'], 401);
		}

		$payload = [
			'exp' => Carbon::now()->addMinutes(30)->timestamp,
			'uid' => User::where('email', $googleUser->email)->first()->id,
		];
---
SELECT * FROM `users` WHERE `email` = 'nugoskhireli@redberry.ge' and `google_id` IS NULL LIMIT 1
SELECT * FROM `users` WHERE `email` = 'nugoskhireli@redberry.ge' LIMIT 1