app/Http/Controllers/QuoteController.php

SELECT * FROM `quotes` LIMIT 1
---
	public function getQuotesForNewsFeed()
	{
		return response()->json(Quote::latest()->get(), 200);

SELECT * FROM `quotes` WHERE `id` = '1' LIMIT 1
---
	public function show($id)
	{
		$quote = Quote::where('id', $id)->first();