app/Http/Controllers/QuoteController.php

	public function index(): JsonResponse
	{
		$quotesData=Quote::orderBy('id', 'DESC')->with('comments','comments.user:id,name,thumbnail', 'likes', 'user:id,name,thumbnail', 'movie:id,name')->paginate(5);
---
SELECT `id`, `name` FROM `movies` WHERE `movies`.`id` in (1, 2, 3)
SELECT `id`, `name`, `thumbnail` FROM `users` WHERE `users`.`id` in (1, 2)
SELECT count(*) as aggregate FROM `quotes`
SELECT * FROM `comments` WHERE `comments`.`quote_id` in (1, 3, 5, 6, 7)

	public function show($movie): JsonResponse
	{
		$quoteList = Quote::where('movie_id', $movie)->with('likes', 'comments')->get();
---
SELECT * FROM `comments` WHERE `comments`.`quote_id` in (1)
SELECT * FROM `likes` WHERE `likes`.`quote_id` in (1)

	public function quoteDetails(Quote $quote): JsonResponse
	{
		$commentsData=Comment::where('quote_id', $quote->id)->with('user:id,name,thumbnail')->get();
---
SELECT * FROM `comments` WHERE `comments`.`quote_id` in (1)
SELECT `id`, `name`, `thumbnail` FROM `users` WHERE `users`.`id` in (1)

	public function update(AddQuoteRequest $request): JsonResponse
	{
		$quote = Quote::where('id', $request->quote_id)->first();
---
SELECT * FROM `quotes` WHERE `id` = 1 LIMIT 1

	public function create(AddQuoteRequest $request, Quote $quote): JsonResponse
	{
		$this->updateOrCreateQuote($request, $quote);
		$quotesData=Quote::with('comments','comments.user:id,name,thumbnail', 'likes', 'user:id,name,thumbnail', 'movie:id,name')->latest()->get();
---
UPDATE `quotes` SET `quote` = '{\"en\":\"first quote123\",\"ka\":\"\\u10ea\\u10d8\\u10e2\\u10d0\\u10e2\\u10d0\"}', `quotes`.`updated_at` = '2022-12-14 15:33:27' WHERE `id` = 1
SELECT * FROM `comments` WHERE `comments`.`quote_id` in (1)
SELECT * FROM `likes` WHERE `likes`.`quote_id` in (1)
SELECT `id`, `name` FROM `movies` WHERE `movies`.`id` in (1)
SELECT `id`, `name`, `thumbnail` FROM `users` WHERE `users`.`id` in (1)

	private function updateOrCreateQuote($request, $quote)
	{
		if ($request->id ? $quote->movie_id = $request->id : null);
		if ($request->user_id ? $quote->user_id = $request->user_id : null);
		$thumbnail = $request->file('thumbnail')->store('images');
		$quote->thumbnail = $thumbnail;
		$quote->setTranslation('quote', 'en', $request->quote_en);
		$quote->setTranslation('quote', 'ka', $request->quote_ka);
		$quote->save();
---
INSERT INTO `quotes` (`movie_id`, `user_id`, `thumbnail`, `quote`, `updated_at`, `created_at`) VALUES ('1', '1', 'images/ZonkZyjm7OdHRBoXtGh9tTRfnWSJtHBBJZoqpbGq.jpg', '{\"en\":\"first quote\",\"ka\":\"\\u10ea\\u10d8\\u10e2\\u10d0\\u10e2\\u10d0\"}', '2022-12-13 16:17:19', '2022-12-13 16:17:19')