app/Providers/AuthServiceProvider.php

SELECT * FROM `users` WHERE `id` = 1 LIMIT 1
SELECT * FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
	public function boot()
	{
			$this->registerPolicies();
			Auth::extend('broadcast-token', function ($app, $name, array $config) {
				// Return an instance of Illuminate\Contracts\Auth\Guard...

				return new JwtGuard(Auth::createUserProvider($config['provider']));
		});

			return User::find(1);
			Auth::viaRequest('broadcast-token', function (Request $request) {
				$decoded = JWT::decode(
					request()->cookie('access_token') ?? substr(request()->header('Authorization'), 7),
					new Key(config('auth.jwt_secret'), 'HS256')
				);
				return User::find($decoded->uid);